{
    "descriptors":
    [
        {
          "name": "Calling",
          "description": "A calling effect transports a creature from another plane to the plane you are on. The effect grants the creature the one-time ability to return to its plane of origin, although the effect might limit the circumstances under which this is possible. Creatures who are called die if they are killed on the new plane. A called creature can’t be dispelled, even if it was called by magical means."
        },
        {
          "name": "Charm",
          "description": "A charm effect changes how the subject views you. This gives you the ability to befriend and suggest courses of action to another creature, but its servitude is not absolute or mindless. Essentially, a charmed character retains free will but makes choices according to a skewed view of the world.\nA charmed creature retains its original alignment and allegiances, generally with the exception that it now regards the person who charmed it as a dear friend and gives great weight to that character’s suggestions and directions. A charmed creature does not volunteer information or tactics that its master doesn’t ask for. A charmed creature never obeys a command that is obviously suicidal or grievously harmful to it.\nA creature fights friends it had before being charmed only if they threaten its new friend. Even then, it uses the least lethal means at its disposal, for it wishes to resolve the conflict without causing real harm. A charmed creature can attempt an opposed Charisma check against its master in order to resist instructions or commands that would make it do something it wouldn’t normally do even for a close friend. If it succeeds at this check, it decides not to go along with that particular order but remains charmed. If the creature’s master commands it to perform an action that the creature would be vehemently opposed to, it can attempt a new saving throw to break free of its master’s influence altogether.\nIf a charmed creature is openly attacked by the character who charmed it or by that character’s apparent allies, it is automatically freed of the spell or effect."
        },
        {
          "name": "Compulsion",
          "description": "A compulsion effect overrides the subject’s free will in some way, forcing the subject to act in some manner or changing the way its mind works."
        },
        {
          "name": "Creation",
          "description": "A creation effect manipulates matter to create an object or creature in the place the creator designates. If the effect has a duration other than instantaneous, magic or some other energy holds the creation together, but when the duration ends, the created creature or object vanishes without a trace. If the effect has an instantaneous duration, the created object or creature does not depend on any outside energy for its existence, so it lasts indefinitely once created."
        },
        {
          "name": "Language-Dependant",
          "description": "A language-dependent effect uses intelligible language (either audible, visual, or telepathic) as a medium for communication. If you cannot communicate with the target or the target cannot understand what you are communicating, the effect fails to affect that target."
        },
        {
          "name": "Mind-Affecting",
          "description": "A mind-affecting effect works only against creatures with an Intelligence score of 1 or higher."
        },
        {
          "name": "Pain",
          "description": "A pain effect causes unpleasant sensations but not permanent physical damage. Creatures that are immune to effects that require a Fortitude save are immune to pain effects."
        },
        {
          "name": "Scrying",
          "description": "A scrying effect creates an invisible magical sensor that sends you information while the effect lasts. Unless noted otherwise, the sensor has the same sensory abilities that you have naturally, but not any sensory abilities you gain from other spells or technology. The sensor is a separate, independent source of sensory input for you, and thus it functions normally even if you have been blinded or deafened or otherwise suffer sensory impairment.\nA creature can notice a scrying sensor with a successful Perception check (DC = 20 + the spell or effect’s level). The sensor can be dispelled as if it were an active spell. Lead sheeting, force fields, and some exotic materials and magical protections block scrying effects; if that is the case, you can sense that the effect has been blocked."
        },
        {
          "name": "Sense-Dependent",
          "description": "A sense-dependent effect has either audible or visual elements, requiring sight or hearing to have any effect. For this kind of effect to affect that target, you must be able to either see or hear the target, and the target must be able to either see or hear you."
        },
        {
          "name": "Shadow",
          "description": "A shadow effect creates something that is partially real from an amalgamation of extradimensional energy. Damage dealt by a shadow effect is real."
        },
        {
          "name": "Summoning",
          "description": "A summoning effect instantly brings a creature or object to a place you designate. When the effect ends or is dispelled, a summoned creature is instantly sent back to where it came from (typically another plane, but not always), but a summoned object is not sent back unless the effect description specifically indicates otherwise. A summoned creature also goes away if it is killed or if its Hit Points drop to 0, but it is not really dead. It takes 24 hours for the creature to reform in the place from which it was summoned, during which time it can’t be summoned again."
        },
        {
          "name": "When a summoning effect ends and the summoned creature disappears, all spells it has cast expire. A summoned creature cannot use any innate summoning abilities it may have.",
          "description": ""
        },
        {
          "name": "Teleportation",
          "description": "A teleportation effect involves instantaneous travel through the Astral Plane (see page 471). Anything that blocks astral travel also blocks teleportation unless the specific effect notes otherwise."
        },
        {
          "name": "Force",
          "description": ""
        },
        {
          "name": "Fire",
          "description": ""
        },
        {
          "name": "Sonic",
          "description": ""
        },
        {
          "name": "Healing",
          "description": ""
        },
        {
          "name": "Death",
          "description": ""
        },
        {
          "name": "Electricity",
          "description": ""
        },
        {
          "name": "Poison",
          "description": ""
        },
        {
          "name": "Disease",
          "description": ""
        },
        {
          "name": "Radiation",
          "description": ""
        },
        {
          "name": "Cold",
          "description": ""
        },
        {
          "name": "Emotion",
          "description": ""
        },
        {
          "name": "Fear",
          "description": ""
        },
        {
          "name": "Acid",
          "description": ""
        },
        {
          "name": "Water",
          "description": ""
        },
        {
          "name": "Air",
          "description": ""
        },
        {
          "name": "Chaotic",
          "description": ""
        },
        {
          "name": "Curse",
          "description": ""
        },
        {
          "name": "Darkness",
          "description": ""
        },
        {
          "name": "Earth",
          "description": ""
        },
        {
          "name": "Evil",
          "description": ""
        },
        {
          "name": "Good",
          "description": ""
        },
        {
          "name": "Lawful",
          "description": ""
        },
        {
          "name": "Light",
          "description": ""
        }
    ]
}