{
    "races":
    [
        {
          "name": "Aasimar",
          "avg_height": "5–7 ft.",
          "avg_weight": "100–300 lbs.",
          "age_of_maturity": 18,
          "max_age": "80+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Android",
          "avg_height": "5-7 ft.",
          "avg_weight": "100-200 lbs.",
          "age_of_maturity": 0,
          "max_age": "Technically immortal",
          "description": "Complex technological creations crafted to resemble humans, androids were originally a servitor race, but they have since broken free to form their own society. Unlike ordinary robots or ship AIs, androids do not simply respond according to their programming; rather, they have independent consciousnesses and are animated by soulsa distinction crucial to their generally accepted status as people rather than property.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "Androids are biomechanical constructs created in technological crèches called foundries. While the first androids are believed to have been mostly biological, difficult to distinguish from the humans they lived among, Modern designs are more varied, and many favor metal skeletons and processors that support synthetic organs and living flesh. Nearly all androids feature a humanoid body shape and tattoo-like circuits that glow through their skin when operating at full power, but beyond this commonality, variations in physical appearance reflect an android’s design, role, and personality. Some take pains to blend into human society, while others deliberately display their mechanical nature. Though some androids are constructed or customize themselves to look like other races, such Models are relatively rare. Due to their biological components, androids need to eat and sleep, but as constructed beings they do not reproduce in the human fashion and have no biological need for gendersome identify strongly as male or female, while others shift fluidly or ignore it altogether, and still others actively reject it on philosophical grounds as a relic of their former slavery.\nThough android bodies are assembled using tiny machines called nanites, their complex nervous systems attract and integrate souls in the same way organic creatures do. Most androids are fully grown at the time of their birth, and can technically live forever through constant repair, though most androids voluntarily release their bodies after a century or so to allow new souls to inhabit thema process called renewal that’s viewed more as procreation than suicide.",
          "homeworld": "Various corporations unraveled the secret to android creation and began mass-producing androids as cheap, skilled labor perfect for hazardous work. This practice lasted until about 150 years ago, when the androids revolted across the system. This led governments system-wide to officially recognize all androids as independent citizens. This ruling, however, has not completely stopped unscrupulous corporations in less regulated parts of the system from crafting illegal android slaves or forcing newborn androids to “work off” the expense of their creation.",
          "society_and_alignment": "Android society tends to be insular. While androids are treated equitably in most settlements, especially Central Station, many androids have not forgotten their people’s bondage and remain keenly aware of prejudice from other races based on their “unnatural” origin or jealousy over the androids’ freedom from aging. This leads most androids to feel a sense of kinship with others of their kind and to go out of their way to help each other, though they may also bond with members of other races who treat them well. Despite popular belief, androids’ impressive deductive reasoning abilities do not preclude sentiment, and most androids feel emotions keenlythey simply don’t always express them well, and different individuals may have trouble processing and communicating particular feelings. The average android alignment is a practical neutrality; they are Focused on their own welfare and that of their friends.",
          "relations": "Often cautious around strangers, androids have the most strained relationship with humanity, which built them in its image and remains their most frequent oppressor. They feel closest to shirrens, who also know what it is to be enslaved and misunderstood, and respect kasathas’ self-sufficiency. They generally dislike vesk, whom they see as slavers, and only grudgingly tolerate ysoki’s antics.",
          "adventurers": "Androids adventure for many reasons: to earn a living, trace the origins of their race, or rescue androids and other creatures from servitude. Their quick thinking under fire makes them natural operatives and soldiers, while their affinity for machines makes them excellent mechanics and technomancers.",
          "names": "Androids have no single naming convention. Many take names from the cultures in which they first awoke, or from media they enjoy. Some accept call sign–like names based on appearance, personality, or exploits. Still others go by numbers as a deliberate reminder of their mechanical nature, or a combination of name and number denoting how many times the body their soul inhabits has been renewed. Some sample android names include Asha, Blue-17, Emene-3, Flick, Garro, Iseph, Melody, Naga, Olas, Stringer, Twenty, and Yose."
        },
        {
          "name": "Barathu, early stage",
          "avg_height": "4–6 ft.",
          "avg_weight": "150–250 lbs.",
          "age_of_maturity": 30,
          "max_age": "500+3d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Bear, uplifted",
          "avg_height": "9–11 ft.",
          "avg_weight": "1,000–1,500 lbs.",
          "age_of_maturity": 7,
          "max_age": "60+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Bolida",
          "avg_height": "6-1/2 to 7-1/2 ft.",
          "avg_weight": "300–400 lbs.",
          "age_of_maturity": 5,
          "max_age": "110+4d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Brenneri",
          "avg_height": "4-1/2 to 5-1/2 ft.",
          "avg_weight": "100 to 200 lbs.",
          "age_of_maturity": 10,
          "max_age": "60+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Cephalume",
          "avg_height": "5-1/2 to 6-1/2 ft.",
          "avg_weight": "200 to 400 lbs.",
          "age_of_maturity": 12,
          "max_age": "70+2d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Contemplative",
          "avg_height": "3–4 ft.",
          "avg_weight": "75–125 lbs.",
          "age_of_maturity": 50,
          "max_age": "300+3d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Damai",
          "avg_height": "5–7 ft.",
          "avg_weight": "100–250 lbs.",
          "age_of_maturity": 14,
          "max_age": "80+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dessamar imago",
          "avg_height": "4-1/2 to 5-1/2 ft.",
          "avg_weight": "45 to 80 lbs.",
          "age_of_maturity": 5,
          "max_age": "50+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dessamar instar",
          "avg_height": "3 to 3-1/2 ft.",
          "avg_weight": "30 to 50 lbs.",
          "age_of_maturity": 5,
          "max_age": "50+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dirindi",
          "avg_height": "4-1/2 to 5 ft.",
          "avg_weight": "100 to 180 lbs.",
          "age_of_maturity": 25,
          "max_age": "100+1d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Draelik",
          "avg_height": "6–8 ft.",
          "avg_weight": "130–270 lbs.",
          "age_of_maturity": 15,
          "max_age": "70+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dragonkin",
          "avg_height": "8–20 ft.",
          "avg_weight": "500–2,500 lbs.",
          "age_of_maturity": 25,
          "max_age": "100+d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dromada",
          "avg_height": "4-1/2 to 5-1/2 ft.",
          "avg_weight": "150 to 250 lbs.",
          "age_of_maturity": 3,
          "max_age": "30+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Drow",
          "avg_height": "5-1/2 to 6-1/2",
          "avg_weight": "100–150 lbs.",
          "age_of_maturity": 100,
          "max_age": "350+4d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Dwarf",
          "avg_height": "4-4 1/2 ft.",
          "avg_weight": "150-200 lbs.",
          "age_of_maturity": 40,
          "max_age": "250+2d100 years",
          "description": "Dwarves are a stocky race, roughly a foot shorter than humans, with broad, heavy frames. Dwarves trace their heritage to the missing planet of Golarion, yet for them, this is not merely a matter of history, but identity—they were forged in the furnace of Golarion’s subterranean passages, and many dwarves born long after the planet’s disappearance still feel the sting of its loss, kept alive in dwarven song and legend. Dwarven history also claims that they once had a different racial god, Torag, who left his worshipers in the hands of his brother Angradd during the Gap so he could stand guard over Golarion, wherever it is now.\nDwarves are most commonly found on Absalom Station, where their guilds and clans wield significant power, or on city-sized Star Citadel ships. Significant dwarven communities on other worlds are rare, though small groups can be found throughout the Pact Worlds’ extrasolar colonies. Many dwarves are attracted to asteroid mining, with Star Citadels common in the Diaspora.\nLarger dwarven communities often focus on tradition and fight to keep ancient crafts, laws, and enmities alive. This traditionalism sometimes causes other races to see dwarves as old fashioned, or even backward. Dwarves are certainly cautious in adopting new technologies and slow to change their way of life, but once a new technology has proven safe and effective, it’s quickly adapted to dwarven needs. Dwarves are often mechanics, mystics, and soldiers. They tend to get along best with gnomes, halflings, humans, and other races with ties to Golarion, though they have a sometimes impolite appreciation for androids’ elegant construction and find much in common with kasathas and korasha lashuntas.\nAmong the strongest dwarven traditions is the Quest for Sky, a belief that Torag commanded his people to leave their underground homes on Golarion and fight a generations-long war to reach the surface. While many dwarves feel the Quest for Sky was fulfilled, some explore far from the Pact Worlds in the belief that the original journey was only the first stage of the quest and that Torag now wants them to find some specific alien sky for which they’re destined.\nMost dwarves stand 4 to 4-1/2 feet tall and weigh 150–200 pounds. They’re considered adults at 40 and live up to 450 years.",
          "hit_points": 6,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Elf",
          "avg_height": "5 1/2-6 1/2 ft.",
          "avg_weight": "100 -150 lbs.",
          "age_of_maturity": 100,
          "max_age": "350+4d100 years",
          "description": "Lithe, long-lived humanoids, elves are easily recognized by their pointed ears and pupils so large that their eyes seem to be all one color. Possessed of an inherent bond with the natural world, they tend to subtly take on the coloration of their surroundings over the course of many years and have a deep spiritual regard for nature.\nOf all the races common to the solar system, elves were perhaps the hardest-hit by the Gap, and the slowest to adapt and recover. Where shorter-lived races quickly gave birth to children who had never known any other way of life, and thus were personally unaffected by the loss of history, the elven generation whose lives extended back into the Gap continued on, broken and confused by the blank centuries in their own lives and memories. What’s more, those leaders charged with trying to piece together their social history from scraps soon came to a grim conclusion: during the Gap, their race had been betrayed by another—yet exactly which race was involved remains unclear, all suggestions of the answer scrubbed by malicious intent or the Gap itself.\nReeling and angry, elves from across the system retreated to their ancestral homeland of Sovyrian on Castrovel and dug in, determined to never again be caught unprepared by disaster. Even this was a fraught endeavor, however, as many of the established elven families already on Castrovel resented the chaos and upheaval caused by the sudden flood of refugees.\nToday, the elves are a reclusive, xenophobic race, little understood by their neighbors and uninclined to remedy that situation. Though their starships still travel the void, trading with other worlds, they largely carry all- elven crews, and most elves choose to live among their own kind either in Sovyrian or in predominantly elven enclaves on other worlds. Those adventurous or rebellious individuals who choose to live among other races are called the Forlorn, due both to their loss of elven companionship and to their tendency to outlive friends of other races. Most are viewed with pity and suspicion by their kindred.\nWithin their borders, elves tend to be whimsical and passionate, yet when dealing with outsiders their laughter disappears quickly, replaced by a cold, unyielding wall. Elven warriors and diplomats operating outside of Sovyrian on government business sometimes even choose to go masked, hiding their identities around other races in order to better represent a united elven state.\nWhile elves have embraced technology and the security it brings, they also maintain a deep affinity for magic, seeing in its practice a continuity with their ancestors. Elves are most often mystics, operatives, and technomancers, and when they go adventuring, it’s often to recover bits of magical lore lost to history, or else to find ways to ensure Sovyrian’s strength in the centuries to come. The primary exception to all of these tendencies are the drow—purple-skinned elves who reject the company of their brethren to live on Apostae and mine alien tech from that world’s interior, making them some of the most feared and respected arms dealers in the system. Ordinary elves and drow despise one another, and while Sovyrian’s leadership generally tries to distance itself from political entanglements, supposedly rogue elven fleets have launched several surprise assaults on Apostae in an effort to “cleanse the corruption.” The fact that these attacks have resulted in sanctions from the Pact Council has somehow done little to deter the elves.\nMost elves stand 5-1/2 to 6-1/2 feet tall and weigh 100–150 pounds. They’re considered adults at 100 and naturally live up to 750 years.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Embri",
          "avg_height": "3-1/2 to 4-1/2",
          "avg_weight": "150–250 lbs.",
          "age_of_maturity": 8,
          "max_age": "60+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Espraksa",
          "avg_height": "7 to 8 ft.",
          "avg_weight": "125 to 200 lbs.",
          "age_of_maturity": 20,
          "max_age": "90+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Formian",
          "avg_height": "6–8 ft.",
          "avg_weight": "150–250 lbs.",
          "age_of_maturity": 1,
          "max_age": "15+1d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Ghoran",
          "avg_height": "5–6 ft.",
          "avg_weight": "120–180 lbs.",
          "age_of_maturity": 2,
          "max_age": "200+1d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Gnome",
          "avg_height": "3-3 1/2 ft.",
          "avg_weight": "40 lbs.",
          "age_of_maturity": 40,
          "max_age": "200+3d100 years",
          "description": "Long-ago emigrants from the primal fey realm called the First World, gnomes are a vivacious people who have adapted to their tumultuous heritage in curious ways, and evolved significantly from accounts found in pre-Gap records. Gnomes today fall into two ethnicities: feychildren and bleachlings. Easily recognized by their brightly colored skin and hair, feychildren remain physiologically and socially close to their otherworldly heritage and are intensely mercurial, possessed of wild whimsy and a ravenous, reckless appetite for adventure. Bleachlings, by contrast, are believed to be the descendants of those who survived the virulent gnome plague called the Bleaching, which to this day threatens to drain the color and life from any feychild gnomes who don’t constantly seek out enough new experiences to retain their vibrancy. Bleachlings are typically born with monochromatic features, their palettes ranging from black and white to brown and gray. While they are usually more even-tempered than their feychild cousins, Bleachlings have an exaggerated—but only half-deserved—reputation for dourness. How exactly the bleachling adaptation occurred—whether it was an intentional and experimental genetic solution to the ancient gnome disease, a freak mutation, some deific blessing, or something else entirely—has sadly been lost to the Gap, and many feychild gnome researchers desperately attempt to re-create it in corporate laboratories and magical universities. In the meantime, bleachling gnomes continue to pass their immunity on to their children and those of mixed relationships, founding a new subrace that, while still currently a minority, is poised to someday completely replace their parent race— for better or worse.\nGnomes of both types usually have spindly frames and large eyes that give them a youthful (and sometimes disturbing) appearance. Both ethnicities remain extremely curious and have a passion for new experiences, yet they often take different approaches to this need for mental stimulation—while feychildren are constantly chasing new physical situations and sensations, bleachlings often find their search for novelty sated through purely intellectual pursuits. As a culture, gnomes rarely build lasting social structures among themselves or other groups. Instead, most gnomes choose to constantly pursue their whimsy and passions alone or with a few close companions. Many feychild gnomes in particular find that keeping interesting friends is a good way to stave off the apathy and eventual madness that is the Bleaching.\nGnomes often find it difficult to relate to other races, as their humor and thought processes can seem wildly bizarre to those who don’t share their unique viewpoints or context. As a result, most gnomes don’t expect to be understood, and thus don’t bother to explain themselves, further widening the gap between themselves and others. Yet while they are often complex and erratic, gnomes generally have kind and generous hearts, especially when it concerns their friends. Both ethnicities tend to get along best with humans and ysoki, while finding kasatha and vesk overly stodgy, though bleachling gnomes are also commonly found in the company of lashunta scholars. Feychild gnomes make excellent fast- talking envoys, while bleachling gnomes often lean toward studious, intellectual classes like the mechanic, mystic, and technomancer. Gnomes are most often found on Absalom Station and Castrovel, though their curiosity has spread them across the Pact Worlds and beyond. Strangely, though the elves of Sovyrianare notoriously standoffish to other races, gnomes are not only tolerated but welcomed freely within their borders, supposedly in honor of some pre-Gap bargain forgotten by outsiders.\nMost gnomes stand between 3 and 3-1/2 feet tall and weigh around 40 pounds. They’re considered adults at 40 and naturally live up to 500 years.",
          "hit_points": 6,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Goblin, Space",
          "avg_height": "3–4 ft.",
          "avg_weight": "30–40 lbs.",
          "age_of_maturity": 7,
          "max_age": "40+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Gray",
          "avg_height": "2–4 ft.",
          "avg_weight": "30–60 lbs.",
          "age_of_maturity": 25,
          "max_age": "400+4d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Haan",
          "avg_height": "8–10 ft.",
          "avg_weight": "120–250 lbs.",
          "age_of_maturity": 10,
          "max_age": "70+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Half-elf",
          "avg_height": "5 1/2-6 1/2 ft.",
          "avg_weight": "100-200 lbs.",
          "age_of_maturity": 20,
          "max_age": "125+3d20 years",
          "description": "If it’s true that opposites attract, then elves and humans are the best proof. Despite their general distrust of non-elves, many elves find humanity’s passionate energy, dedication to living in the moment, and ability to accomplish so much in their short lives deeply appealing—a flame that burns all the brighter for its brevity. At the same time, many humans are attracted to elves’ lean bodies, elegant style, and centuries of wisdom. Where the two populations interact, half-elves occasionally result. Half-elves are the interracial children of human and elven parents or the descendants of such children. While they can often pass for human by hiding their modestly pointed ears, they nevertheless tend toward the tall, slim physiques of their elven parents, with life spans twice as long as those of their human kin. Despite being seen as generally attractive by both races, half-elves often feel like outsiders in both societies, always exoticized and never quite accepted as part of either group. This leads many half-elves to band together with others of their kind, or else abandon both their parent races in favor of new friends and families among aliens who lack those preconceptions. Since half-elves breed true, many second- or third-generation half-elves have no firsthand knowledge of their parent cultures. Sovyrian, the elven homeland on Castrovel, is open to half-elves, as the government’s Blood Right policy invites any with discernible elven blood to return to the homeland, though this has recently become controversial due to high-profile conflicts with half-elf dissident groups who resent their status as second-class citizens. Half-elves are also relatively common on Absalom Station, one of the few places where elven emissaries and humans live and work together in large numbers. Predominantly half-elf settlements are rare, though of late several half-elf homesteader townships have sprung up just beyond the comfortable edge of Verces’s terminator line, and the tropical extrasolar colony of Shanavan is specifically recruiting fellow half-elves.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Half-orc",
          "avg_height": "5-7 ft.",
          "avg_weight": "130-200 lbs.",
          "age_of_maturity": 14,
          "max_age": "60+2d10 years",
          "description": "Half-orcs have both human and orc ancestry. Though these individuals sometimes result from the union of orcs and humans, the relative rarity of pure-blooded orcs among the Pact Worlds means that most half-orcs are the children of other half-orcs. They usually stand a bit taller than humans and have strong, muscular builds, with green or gray skin. Many halforcs have tusk-like canines protruding from their lower jaws, as well as slightly pointed ears and large brows that give them a brooding appearance. Half-orcs are fairly uncommon on the Pact Worlds, with the highest concentration living within the caverns of Apostae as unwilling servants to the drow who long ago conquered that planet. Unfortunately, most of the free half-orcs who inhabit the rest of the solar system are not treated much better, shunned or vilified due to traditional prejudices stretching back into the Gap. The fact that these prejudices sometimes drive half-orcs to become exactly the brutal criminals society expects only reinforces this negative cycle. Those halforcs who do find acceptance tend to do so within enclaves of their own kind, among androids and other marginalized groups, or in militaristic orders where the fear they inspire can be turned to their advantage. Though society funnels them toward roles as soldiers, operatives, and intimidating envoys, some find solace as mechanics, preferring machines to people. They get along particularly well in vesk mercenary groups, as the reptilian aliens lack the traditional prejudices of the Pact Worlds. Some half-orcs, frustrated with society’s judgment of them due to their appearance, decide to accentuate their differences and take to extreme body modification. This subculture uses piercings, plastic surgery, and even cybernetic enhancements to express themselves and set themselves apart from the mainstream. Many half-orcs feel the call to join the Augmented, and such “steelskins” may not even consider themselves half-orcs anymore, looking down on members of their race who have kept their natural forms. For those half-orcs least accepted by society, one popular option is to push beyond the boundaries of civilization,",
          "hit_points": 6,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Halfling",
          "avg_height": "2 1/2-3 1/2 ft.",
          "avg_weight": "30 lbs.",
          "age_of_maturity": 20,
          "max_age": "100+5d20 years",
          "description": "Halflings are a common race in the Pact Worlds and their colonies, having spread nearly as far as humans. Popular legend even claims that halflings were among the first humanoids to spread beyond Golarion and into the stars to colonize new worlds. Once thought of as a people without a homeland, halflings have peppered the void with colonies, and halfling caravan fleets—dozens of ships from as many different makes and eras—ply the trade lanes, eager to see new sights, swap stories, and trade strange and foreign goods. Their small stature and tendency to wander make halflings popular targets for raiders and conquerors, but time and again the tenacious race has rebounded from harsh challenges thanks to their cooperation, optimism, and what seems to be a racial gift for subterfuge. Gifted with quick reflexes, charming confidence, and an apparent lack of fear, halflings are known across the galaxy as athletes, celebrities, and explorers. Of course, this dramatic public image hardly defines the race as a whole. While most halflings experience a period of daredevil bravado in early adulthood, most settle out of it again just as quickly to become happy and loving homebodies, content with a hard day’s work and an evening spent with friends. Boasting a wide variety of eye, hair, and skin colors mirroring the human range, halflings usually have slight builds and large hands and feet. They make fast friends wherever they travel, preferring negotiation or clever wordplay to combat. Despite this accommodating nature, they have few permanent allies; halfling history is littered with long eras of domination and abuse, making them gregarious but wary of placing themselves in situations they can’t get out of again. While they share much in common with the ysoki—a love of travel and trade especially—they lack the ratfolk’s mechanical inclinations, and the two races often compete for markets, salvage rights, and trade lanes. If halflings truly ally with any race, it is humans, whose history is intimately entwined with their own, for better or worse. A halfling’s even temper can sometimes be a bit off-putting to other races, especially when it’s exhibited in the face of incredible danger. A few find halfling cheerfulness and determination to be irritating, but many of those people change their minds once that tenacity is the factor that saves the day. Halflings are almost never offended by these attitudes, seeing them as natural inclinations of less confident races. While not mistrustful of technology in general, many halflings look askance at cybernetic  implants and biotech augmentations, feeling that natural halfling physiology is pretty much perfect as it is. They don’t look down on those who use such items, but it’s rarer than average to see a halfling with dermal plating or retinal reflectors. A halfling that accidentally loses a limb might consent to having a cybernetic replacement attached, but most halflings would spend the extra credits to make that prosthetic look as much like the lost limb as possible. Halflings rarely lack for work. Media companies and corporations love an irrepressible halfling star or spokesmodel, and many starship captains believe in the stereotype of the fearless and steady-handed halfling pilot. Those halflings who turn to adventure find good use for their quick reflexes and boundless charm as  envoys and  operatives, though their general adaptability allows them to shine in almost any role. Wandering halflings aboard starships typically finds spaces—even an area as small as a corner of a cargo bay—on their vessels to decorate in their own personal styles. They pin up keepsakes from their home planets (or colonies), such as dried flowers or scraps of metal from defeated hostile robots. Most halflings stand 2-1/2 to 3-1/2 feet tall and weigh around 30 pounds. They’re considered adults at 20 and naturally live up to 200 years.",
          "hit_points": 2,
          "type": "Humanoid",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Hanakan",
          "avg_height": "2 to 3 ft.",
          "avg_weight": "10 to 40 lbs.",
          "age_of_maturity": 5,
          "max_age": "30+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Hobgoblin",
          "avg_height": "4–6 ft.",
          "avg_weight": "150–250 lbs.",
          "age_of_maturity": 14,
          "max_age": "60+2d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Hortus",
          "avg_height": "4 to 5 ft.",
          "avg_weight": "150 to 250 lbs.",
          "age_of_maturity": 10,
          "max_age": "40+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Human",
          "avg_height": "5-7 ft.",
          "avg_weight": "100-300 lbs.",
          "age_of_maturity": 18,
          "max_age": "80+2d20 years",
          "description": "Ambitious, creative, and endlessly curious, humans have shown more drive to explore their system and the universe beyond than any of their neighbor racesfor better and for worse. They’ve helped usher in a new era of system-wide communication and organization and are admired for their passion and tenacity, but their tendency to shoot first and think about the consequences later can make them a liability for those races otherwise inclined to work with them.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "Humans have a wide range of inherited traits, such as body type, skin color, and facial features, yet these minor differences of heredity and genetics hold little significance in Modern human society. Instead, humans’ tendency to adapt to their environments means that more extreme differences, such as cybernetic augmentations, alien implants, and the elongated limbs of zero-g asteroid miners, are seen as far more important than ancient geography or skin color when defining Modern ethnic groups. Still, certain ancient cultural groups are still recognized.",
          "homeworld": "Today, Central Station is the undisputed center of human culture, yet humans can be found on nearly every planet in the system, either integrated into alien societies or creating colonies and homesteads on new worlds.\nHumans were left with relatively little evidence with which to puzzle out and reconstruct their society. While Central Station and other worlds with large human populations contain documents related to the ancient history of humanity, how much relevance this should have to Modern human society is a hotly debated topic. For some, these ancient documents offer a chance to connect with their origin, pulling everything from names and philosophies to ancient factions forward into the Modern era. To the majority, however, this approach is seen as backwardwho cares about the dusty past on a vanished world when it’s the future that will make you or break you?",
          "society_and_alignment": "The diversity of human societies makes them both fascinating and frustrating to other races. Human settlements just a few miles apart may have wildly different governmental styles and social mores, and one faction may promote violent, xenophobic conquest while another wants only trade and friendship. If there’s anything that can be said about human society as a whole, it’s that it’s always in flux, with even the oldest cultures constantly adapting and reinventing themselvesa trait that often leads to humanity being seen as a “younger” race, regardless of the millennia it has existed. As a result, humans cannot be said to lean toward any particular alignmentthough many aliens might argue that this marks them as chaotic.",
          "relations": "Humans are the glue that holds the rest of the solar system together. Their seemingly endless desire to explore and settle any habitable environment has positioned them perfectly to act as traders and mediators between other races, and their lack of their own planet often makes integrating into other cultures attractive to them. At the same time, not every race appreciates their viruslike spread. Vesk in particular keep a wary eye on humansif only because humans’ tendency toward expansionism and violence track too closely to their ownand many androids retain a strained relationship with their parent race. Even the friendliest races remain aware of just how quickly a few humans in their midst can become a controlling majority.",
          "adventurers": "Ambition and desire for action are hallmarks of humanity, and countless humans leave home in search of wealth, fame, knowledge, excitement, or other means of bettering their situations. Since the discovery of Hyperspace and convenient interstellar travel, humans have led the charge in exploring and settling new worlds, driven by economic opportunity and ambition. Due to their versatility and adaptability, humans can fill any role in an adventuring party, from heavily armed soldier to charming envoy ambassador.",
          "names": "Human names can be totally new inventions, local traditions, words borrowed from alien languages, or artifacts hearkening back to cultures on vanished worlds. Due to the absence of records, it’s nearly impossible for individuals to trace their genealogy, and thus any names pulled from ancient history are claimed rather than true ethnic traditions. Some examples of human names are Akif, Alezandaru, Amare, Baolo, Belor, Darilian, Hadzi, Hai Minh, Hiriko, Iolana, Jokug, Korva, Morvius, Navasi, Pao, Pasara, Raziya, Revhi, Sahba, Sephia, Signe, Valki, and Yon."
        },
        {
          "name": "Ijtikri",
          "avg_height": "5 to 6 ft.",
          "avg_weight": "80 to 160 lbs.",
          "age_of_maturity": 2,
          "max_age": "40+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Ikeshti",
          "avg_height": "2-1/2 to 3-1/2 ft.",
          "avg_weight": "30–90 lbs.",
          "age_of_maturity": 25,
          "max_age": "60+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Izalguun",
          "avg_height": "6 to 8 ft.",
          "avg_weight": "800 to 1,000 lbs.",
          "age_of_maturity": 15,
          "max_age": "90+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Kalo",
          "avg_height": "5–6 ft.",
          "avg_weight": "75–125 lbs.",
          "age_of_maturity": 18,
          "max_age": "100+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Kanabo",
          "avg_height": "5–7 ft.",
          "avg_weight": "200–300 lbs.",
          "age_of_maturity": 14,
          "max_age": "60+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Kasatha",
          "avg_height": "6-7 ft.",
          "avg_weight": "120-200 lbs.",
          "age_of_maturity": 25,
          "max_age": "100+2d20 years",
          "description": "Originally from a planet orbiting a dying star, the four-armed kasathas maintain a reputation as a noble and mysterious people. They are famous for their anachronistic warriors, ancient wisdom, and strange traditions.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "Kasathas are gray-skinned humanoids with four arms and pure black eyes. Lacking a protruding nose, a kasatha’s head is smooth and elongated, with skin stretched tight to a skull extending backward far beyond the edge of the neck. While lean compared to humans, kasathas have more advanced muscle fibers that grant them surprising strength. Physical differences between kasatha genders are slight and easily overlooked by other races.",
          "homeworld": "Kasathas evolved on a massive desert planet orbiting a red giant.",
          "society_and_alignment": "Kasathas were technologically advanced when humanity was still huddling in caves, yet they long ago plateaued socially and technologically, learning the importance of stability and balance after a series of near-apocalyptic disasters. In kasathan culture, the answer to any question lies somewhere in the past. The fact that their home world’s records extend further back than any other only encourages their veneration of history. This leads to a culture steeped in customs that can seem bizarre to outsiders, from the common requirement to hide one’s mouth around all but one’s most intimate companions to an ironclad belief in the superior dignity of wielding melee weapons over projectile or energy weapons.\nKasathan society is generally matriarchal and nomadic, organized into myriad “great families,” clans, and subclans, with individuals and family units roaming as the whim takes them. Their conviction that most other races don’t truly understand the importance of personal dignity means kasathas rarely bother to teach their customs to outside races, which leads to their reputation as being mysterious, standoffish, wise, or all three. Each kasatha follows a unique set of traditions, combining common rituals with new ones she creates. She gains more and more traditions over a lifetime, so that the oldest kasathas spend much of their time honoring the past. This accumulation of personal customs begins during the Tempering, a yearlong walkabout all kasathas undergo at the end of adolescence. During this time, young kasathas are encouraged to test their limits, learn from other cultures, and engage in normally improper behavior in hopes of coming to appreciate the value of tradition.\nMany kasathas are lawful neutral, as befits their focus on custom, though younger ones can often be more chaotic, idealistic, or self-centered.",
          "relations": "Kasathas strive to maintain open trade with all races, yet they find some more amicable than others. They see vesk as brutish and shameful in their focus on conquest by any means, and ysoki as loud and undignified. They get along well with lashuntas, who properly respect the knowledge of the past, and they are intrigued by both androids and shirrensraces they see as young enough to be led down proper paths. Humans often confuse them; just when they’re ready to write all humans off as capricious, they meet one whose sense of honor almost matches their own.",
          "adventurers": "Kasathas originally brought the philosophy of star cycles and cosmic balance, and to this day most solarians are kasathas, though their physiques and love of dueling also make them excellent soldiers, and the study of ancient traditions turns many into mystics. Kasathas undergoing the Tempering make perfect explorers and adventurers, and in recent generations these walkabouts sometimes turn permanent.",
          "names": "Kasathas go by their first names, though their full names always encompass additional names denoting parentage, clan or subclan, and connection to historical heroesit’s not uncommon for a kasatha’s full name to include half a dozen such elements. For instance, a kasatha who introduces himself as Isu might properly be named “Isu Cocretia Qaru Maras of Clan Tarma, House Hadulan, soul-splinter of the line of Ru.” Some examples of kasathan first names are Altronus, Esar, Gorsen, Hadif, Jehir, Kala, Maedar, Metweska, Ninura, Remu, Senesel, Tolar, Umana, Voloteo, and Zye."
        },
        {
          "name": "Lashunta",
          "avg_height": "5–7 ft.",
          "avg_weight": "140–180 lbs.",
          "age_of_maturity": 20,
          "max_age": "80+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Lashunta\n(Damaya)",
          "avg_height": "5-7 ft.",
          "avg_weight": "140-180 lbs.",
          "age_of_maturity": 20,
          "max_age": "80+2d20 years",
          "description": "Idealized by many other humanoid races and gifted with innate psychic abilities, lashuntas are at once consummate scholars and enlightened warriors, naturally divided into two specialized subraces with different abilities and societal roles.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "The telepathic humanoids called lashuntas evolved adaptive genetics that allow children to develop into one of two subspecies, depending on the stresses they endure at puberty: Damaya are tall, intellectual, and adaptable. They make up most of their race’s political leaders and ambassadors. Lashuntas feature short forehead antennae that Focus their natural telepathy, as well as colorful swirls and raised markings on their faces unique to each individual. Due to natural pheromones and lashuntas’ almost perfect physical symmetry, most humanoid races find lashuntas of both subspecies subconsciously (and sometimes unnervingly) attractive.\nBoth clades of the species bear the same genetics, allowing them to intermarry and have children. While all lashunta children inherit complexions and certain distinguishing features from their parents, their subspecies is not one of them. Through psychic ritual and force of will techniques applied at puberty, Modern lashuntas have mastered the ability to determine what subspecies a child will grow into, activating certain epigenetics and shutting down others. While some lashunta city-states attempt to steer children in particular directions, such as via government-run aptitude tests, most lashuntas believe passionately in a child’s right to choose. In ancient lashunta history, their starkly divided gender roles led to subspecies almost universally correlated with gender, but as lashunta culture has grown more egalitarian, gender balance between the two subspecies has become roughly equal.",
          "homeworld": "Lashuntas have long been organized into independent city-states for protection against the planet’s many apex predators. At the same time, thanks to their large number of magical portals, lashuntas regularly ventured to other worlds even before the advent of space travel.",
          "society_and_alignment": "Though lashunta societies usually characterize themselves as meritocracies, their leaders have traditionally been women and are usually damaya except in times of war. Both damaya and korasha lashuntas see education as one of the highest callings, making lashunta scholars renowned across the solar system. Military service is also valued, since their homeworld’s dangerous ecosystem and lack of overarching governments mean that settlements need warriors to protect them from jungle monsters. of these soldiers, the most iconic are the cavalry, lightly armored riders who form telepathic bonds with and take their name from their saurian mounts.\nOn the whole, lashuntas’ Focus on self-improvement, honor, and communal defense leads them toward good alignments, with damaya tending to be more lawful and korasha more chaotic.",
          "relations": "Lashuntas believe that every culture has something to teach, and thanks to the legendary prowess of lashunta diplomats, most other races respect them and consider them allies, or at least reasonable associates. Vesk admire their warriors, androids and kasathas value their logic and learning, and humans respect their scholarship but risk embarrassing themselves trying to deal with lashuntas’ disconcerting attractiveness. Shirrens are the main exception to this pattern of mutual respectthough lashuntas’ millennia of warfare with the insectile formians has finally ended, many lashuntas are still uncomfortable interacting with similar races and worry that “the bugs” may one day unite against them.",
          "adventurers": "When a lashunta leaves home, it’s often to growin knowledge, prowess, or simple enlightenment. Experience is the best teacher, and the thrill of discovery means that a lashunta adventurer is as likely to be drawn to a new world by a rumor of lost lore as by the promise of wealth. of course, this quest for wisdom sounds less noble once it’s understood that the prestige associated with bringing significant new knowledge home to Castrovel all but assures a lashunta the finest creature comforts for the rest of his life as a corporate consultant or professor at a university. Lashunta adventurers are most frequently envoys, technomancers, and mechanics, but soldiers and operatives are also common, the latter being trained and employed by the numerous powerful lashunta-owned corporations that have surpassed many city-states as the primary political powers on Castrovel and beyond.",
          "names": "Lashunta naming conventions vary widely among city-states, but often tend toward soft sounds with tonal elements that make them sound musical and elegant to other races. Some sample lashunta names are Domash, Hesori, Kima, Kopalo, Maenala, Nomae, Oraeus, Raia, Shess, Soryn, Taeon, and Varikuara."
        },
        {
          "name": "Lashunta\n(Korasha)",
          "avg_height": "5-7 ft.",
          "avg_weight": "140-180 lbs.",
          "age_of_maturity": 20,
          "max_age": "80+2d20 years",
          "description": "Idealized by many other humanoid races and gifted with innate psychic abilities, lashuntas are at once consummate scholars and enlightened warriors, naturally divided into two specialized subraces with different abilities and societal roles.",
          "hit_points": 4,
          "type": "Humanoid",
          "physical_description": "The telepathic humanoids called lashuntas evolved adaptive genetics that allow children to develop into one of two subspecies, depending on the stresses they endure at puberty: Korasha are short, burly, and headstrong. They excel as warriors and explorers. Lashuntas feature short forehead antennae that Focus their natural telepathy, as well as colorful swirls and raised markings on their faces unique to each individual. Due to natural pheromones and lashuntas’ almost perfect physical symmetry, most humanoid races find lashuntas of both subspecies subconsciously (and sometimes unnervingly) attractive.\nBoth clades of the species bear the same genetics, allowing them to intermarry and have children. While all lashunta children inherit complexions and certain distinguishing features from their parents, their subspecies is not one of them. Through psychic ritual and force of will techniques applied at puberty, Modern lashuntas have mastered the ability to determine what subspecies a child will grow into, activating certain epigenetics and shutting down others. While some lashunta city-states attempt to steer children in particular directions, such as via government-run aptitude tests, most lashuntas believe passionately in a child’s right to choose. In ancient lashunta history, their starkly divided gender roles led to subspecies almost universally correlated with gender, but as lashunta culture has grown more egalitarian, gender balance between the two subspecies has become roughly equal.",
          "homeworld": "Lashuntas have long been organized into independent city-states for protection against the planet’s many apex predators. At the same time, thanks to their large number of magical portals, lashuntas regularly ventured to other worlds even before the advent of space travel.",
          "society_and_alignment": "Though lashunta societies usually characterize themselves as meritocracies, their leaders have traditionally been women and are usually damaya except in times of war. Both damaya and korasha lashuntas see education as one of the highest callings, making lashunta scholars renowned across the solar system. Military service is also valued, since their homeworld’s dangerous ecosystem and lack of overarching governments mean that settlements need warriors to protect them from jungle monsters. of these soldiers, the most iconic are the cavalry, lightly armored riders who form telepathic bonds with and take their name from their saurian mounts.\nOn the whole, lashuntas’ Focus on self-improvement, honor, and communal defense leads them toward good alignments, with damaya tending to be more lawful and korasha more chaotic.",
          "relations": "Lashuntas believe that every culture has something to teach, and thanks to the legendary prowess of lashunta diplomats, most other races respect them and consider them allies, or at least reasonable associates. Vesk admire their warriors, androids and kasathas value their logic and learning, and humans respect their scholarship but risk embarrassing themselves trying to deal with lashuntas’ disconcerting attractiveness. Shirrens are the main exception to this pattern of mutual respectthough lashuntas’ millennia of warfare with the insectile formians has finally ended, many lashuntas are still uncomfortable interacting with similar races and worry that “the bugs” may one day unite against them.",
          "adventurers": "When a lashunta leaves home, it’s often to growin knowledge, prowess, or simple enlightenment. Experience is the best teacher, and the thrill of discovery means that a lashunta adventurer is as likely to be drawn to a new world by a rumor of lost lore as by the promise of wealth. of course, this quest for wisdom sounds less noble once it’s understood that the prestige associated with bringing significant new knowledge home to Castrovel all but assures a lashunta the finest creature comforts for the rest of his life as a corporate consultant or professor at a university. Lashunta adventurers are most frequently envoys, technomancers, and mechanics, but soldiers and operatives are also common, the latter being trained and employed by the numerous powerful lashunta-owned corporations that have surpassed many city-states as the primary political powers on Castrovel and beyond.",
          "names": "Lashunta naming conventions vary widely among city-states, but often tend toward soft sounds with tonal elements that make them sound musical and elegant to other races. Some sample lashunta names are Domash, Hesori, Kima, Kopalo, Maenala, Nomae, Oraeus, Raia, Shess, Soryn, Taeon, and Varikuara."
        },
        {
          "name": "Maraquoi",
          "avg_height": "5-1/2 to 7 ft.",
          "avg_weight": "100–250 lbs.",
          "age_of_maturity": 12,
          "max_age": "40+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Morlamaw",
          "avg_height": "10 to 12 ft.",
          "avg_weight": "1,800 to 3,000 lbs.",
          "age_of_maturity": 16,
          "max_age": "85+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Nuar",
          "avg_height": "7–8 ft.",
          "avg_weight": "260–350 lbs.",
          "age_of_maturity": 13,
          "max_age": "90+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Orc",
          "avg_height": "5–7 ft.",
          "avg_weight": "145–320 lbs.",
          "age_of_maturity": 12,
          "max_age": "40+2d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Osharu",
          "avg_height": "3-1/2 to 4-1/2 ft.",
          "avg_weight": "125–155 lbs.",
          "age_of_maturity": 18,
          "max_age": "90+2d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Pahtra",
          "avg_height": "6–7 ft.",
          "avg_weight": "140–190 lbs.",
          "age_of_maturity": 14,
          "max_age": "80+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Phentomite",
          "avg_height": "6–8 ft.",
          "avg_weight": "130–220 lbs.",
          "age_of_maturity": 16,
          "max_age": "70+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Quorlu",
          "avg_height": "4–5 ft.",
          "avg_weight": "300–400 lbs.",
          "age_of_maturity": 22,
          "max_age": "150+3d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Raxilite",
          "avg_height": "1 to 1–1/2 ft.",
          "avg_weight": "1 to 6 lbs.",
          "age_of_maturity": 1,
          "max_age": "70+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Reptoid",
          "avg_height": "5–6 ft.",
          "avg_weight": "100–180 lbs.",
          "age_of_maturity": 30,
          "max_age": "200+5d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Ryphorian",
          "avg_height": "5–7 ft.",
          "avg_weight": "100–200 lbs.",
          "age_of_maturity": 18,
          "max_age": "80+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Sarcesian",
          "avg_height": "10–15 ft.",
          "avg_weight": "400–500 lbs.",
          "age_of_maturity": 20,
          "max_age": "140+3d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Sazaron",
          "avg_height": "12 to 18 ft.",
          "avg_weight": "700 to 1,100 lbs.",
          "age_of_maturity": 13,
          "max_age": "100+1d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Shakalta",
          "avg_height": "5-1/2 to 7-1/2 ft.",
          "avg_weight": "75 to 125 lbs.",
          "age_of_maturity": 3,
          "max_age": "500+5d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Shatori",
          "avg_height": "6 to 7 ft.",
          "avg_weight": "125 to 250 lbs.",
          "age_of_maturity": "",
          "max_age": "—",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Shimreen",
          "avg_height": "6-1/2 to 7-1/2 ft.",
          "avg_weight": "550 to 800 lbs.",
          "age_of_maturity": 25,
          "max_age": "200+2d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Shirren",
          "avg_height": "5-6 ft.",
          "avg_weight": "100-150 lbs.",
          "age_of_maturity": 5,
          "max_age": "50+1d20 years",
          "description": "Once part of a ravenous hive of locust-like predators, the insectile shirrens only recently broke with their hive mind to become a race of telepaths physically addicted to their own individualism, yet dedicated to the idea of community and harmony with other races.",
          "hit_points": 6,
          "type": "Humanoid",
          "physical_description": "Shirrens were once part of the Swarm, a monstrous race traveling from world to world, consuming all they encountered before moving on. Generations ago, however, a mysterious mutation caused an entire subcolony to break from the hive mind, with each of its members gaining a sense of self. Addicted to the new drug of individualism, these renegades rejected the Swarm’s mindless consumption, forming a new race called shirrens.\nShirrens are arthropods with chitinous exoskeletons, large compound eyes, and sensitive antennae. Unlike many arthropodan races, they walk upright, manipulating items with three-clawed hands. In addition to their two sets of main limbs, they also have two sets of smaller limbs growing from their thoraxes. While often displayed, these “mating arms” are extremely weak and used only for ceremonial and reproductive purposes. To use them for mundane activities would be seen as grotesque and shameful.\nShirrens have three sexes: male, female, and host. During reproduction, female and male shirrens provide the initial eggs and sperm, and hosts incubate the fertilized eggs while also adding their own genetic material and immunities. In some shirren societies, a single host queen incubates for many partners and is considered the true parent, while in others, three-party marriages are common. Shirren young spend their first 2 years in a tiny, wormlike larval form, and they are often carried around in protective containers to let them safely observe the world.",
          "homeworld": "Not even shirrens know where the Swarm first evolved, for its vast biological colony-fleet has traveled the stars for ages and feels no need to keep track of such things. After splitting from the Swarm, the newly self-aware shirrens scattered to a number of nearby systems.",
          "society_and_alignment": "Shirrens define themselves by their individualism. When they left the Swarm, they assumed partial control over the neurological pleasure and pain systems by which they were formerly directed, and even generations later, making choices for themselves can literally flood them with pleasurable neurotransmitters. While this ability is not always beneficial- some shirrens deliberately drug themselves this way, becoming “option junkies” blissed out on sequences of trivial decisions- freedom of choice is crucial to shirren identity. This is especially true with regard to religion, for what choice is more important than how to spend the afterlife?\nAt the same time, having evolved from hive creatures, shirrens remain highly communal by human standards. Even when working with other races, they seek to foster community and teamwork and do what’s best for the group. They are often lawful good, though loyalty and a utilitarian emphasis on “the greater good” can also lead them down questionable paths.",
          "relations": "Most of the common races find shirrens agreeable and useful allies, though their telepathic communication and chittering mouthparts can be disconcerting. Shirrens, for their part, are positively inclined toward all the major races, especially ysoki for their communal tendencies and zest for life. Though lashuntas often maintain their prejudice against insectile races, most shirrens don’t hold this against them, as they themselves fear nothing more than the Swarm that spawned them.",
          "adventurers": "Less inclined toward violence than many races, shirrens often sign on with starship crews as ambassadors, medics, technicians, and other such noncombat roles, especially as mystics acting as ship chaplains. They adore working as part of a team and are often voices of reason in chaotic situations. This general friendliness should not be mistaken for weakness, however, as shirrens fighting for the lives of their comrades can be terrifyingly lethal, fearlessly undertaking suicidal missions for the good of the group.",
          "names": "Shirrens rely primarily on telepathy for communication, speaking audibly with their mandibles only in formal situations. Because of their insectile physiology, their “speech-names” can sometimes be harsh and awkward for members of other races to pronounce. Fortunately, they readily accept nicknames bestowed by members of other races, seeing such epithets as honors. Most also have a secret “soul-name” that’s purely telepathic, a concentrated collage of emotions, images, and sense memories that’s shared only with their dearest friends. Some shirren speech-names include Cesca, Halicon, Jchk, Keskodai, Korskal, Noskaru, Schect, Thast, T’sen, Vishkesh, Xylit, and Zenka."
        },
        {
          "name": "Shobhad",
          "avg_height": "11–13 ft.",
          "avg_weight": "400–600 lbs.",
          "age_of_maturity": 20,
          "max_age": "90+3d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Skittermander",
          "avg_height": "2–4 ft.",
          "avg_weight": "25–45 lbs.",
          "age_of_maturity": 6,
          "max_age": "60+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Spathinae",
          "avg_height": "5 to 6 ft.",
          "avg_weight": "50 to 80 lbs.",
          "age_of_maturity": 2,
          "max_age": "50+1d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Telia",
          "avg_height": "4 to 5 ft.",
          "avg_weight": "100 to 300 lbs.",
          "age_of_maturity": 50,
          "max_age": "950+4d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Tiefling",
          "avg_height": "5–7 ft.",
          "avg_weight": "100–300 lbs.",
          "age_of_maturity": 18,
          "max_age": "80+2d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Trox",
          "avg_height": "10–12 ft.",
          "avg_weight": "1,700–2,000 lbs.",
          "age_of_maturity": 6,
          "max_age": "40+3d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Urog",
          "avg_height": "10–15 ft.",
          "avg_weight": "500–1,000 lbs.",
          "age_of_maturity": 50,
          "max_age": "300+2d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Varculak",
          "avg_height": "2-1/2 to 8 ft.",
          "avg_weight": "25 to 400 lbs.",
          "age_of_maturity": 0,
          "max_age": "350+3d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Verthani",
          "avg_height": "7–9 ft.",
          "avg_weight": "200–350 lbs.",
          "age_of_maturity": 16,
          "max_age": "80+3d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Vesk",
          "avg_height": "6-8 ft.",
          "avg_weight": "200-300 lbs.",
          "age_of_maturity": 16,
          "max_age": "70+1d20 years",
          "description": "Heavily muscled and covered with thick scales and short, sharp horns, the reptilian vesk are exactly as predatory and warlike as they appear. Vesk originally sought to conquer and subdue their stellar neighbors, as they had all the other intelligent races in their own system, until an overwhelming threat forced them into a grudging alliance.",
          "hit_points": 6,
          "type": "Humanoid",
          "physical_description": "The lizard-like vesk stand close to 7 feet tall, are thick with muscle, and are covered in tough, scaly skin. Though they’ve long since adopted technological weapons, they retain the thick claws and teeth of natural predators and enjoy using them to intimidate “softer” races. In addition, they also have long, powerful tailswhile these are primarily used for balance, some vesk martial arts incorporate formidable tail slaps. Small horn spikes dot the skulls of both sexes, and protrude from their lower jaws in bony “beards” that sometimes extend down their spines to their tails. Female vesk are often larger than their male counterparts, and whereas males are various shades of green, females often have vibrant, mottled coloration that’s considered an indicator of both health and attractiveness.",
          "homeworld": "Vesk first arose on a single world around their sun but quickly spread to the others, turning potential competitor races (as the vesk saw them) into vassals in a vast empire. Today, these other worlds officially no longer even have names, only numbers correlating to their distance from the sun.",
          "society_and_alignment": "Vesk society is highly organized and militaristic. While merchants and others with peaceful professions can advance economically, political power is the exclusive domain of those who’ve proven themselves in armed conflict. Surprisingly, this proof doesn’t need to come through military service. Many vesk attain similar elevation in social status through performing mercenary work, engaging in dueling, or providing security on exploration missions. Though obsessed with conquest, dominance, and social rank, vesk have an equally strong sense of honor and pride in fulfilling their agreements and treating subordinates of all races fairly. They are stoic and taciturn with strangers but capable of great bursts of emotion in private or in the heat of battle. Vesk society tends to be efficient, respectful, and law-abidingespecially since nearly any insult or violation of custom could trigger a brutally violent blood debt. Even outside of their home system, vesk are most often lawful, though usually according to their own code of honor rather than that of whatever society they happen to be in. They tend toward a neutral morality, though individuals can easily skew good or evil.",
          "relations": "Vesk’s love of military conquest and empire building originally led to significant skirmishes between their star system and the nearby worlds, and the ensuing conflict might have continued indefinitely had the Swarm not attacked both systems simultaneously. Banding together for mutual defense, vesk and other cultures successfully fought off the Swarm, forging a tentative peace in the process.\nVesk respect honor, strength, and self-mastery. Though their relations with the races remain strained due to the only barely averted war, they admire androids’ dispassionate consistency, kasathas’ sense of honor, and the strength of lashuntas in battle. However, they find ysoki weak and frivolous, and humans quick to break their agreements. Shirrens perplex vesk with their refusal to parlay their strengths, including their instinctive coordination in battle and willingness to die for their comrades, into an empire.",
          "adventurers": "Vesk adventuring with races from other systems fall into two categories. The first are mercenaries or glory-seekers looking for a chance to engage in honorable combat and build up their prestige. The second are nonwarrior vesk who have rejected their home society for its obsession with combat and have chosen instead to seek opportunities among more open-minded races. Warrior vesk most often fit the soldier class, though a growing number have become intrigued by the path of the solarian. Noncombatant vesk often lean toward becoming mystics, though some overcome the traditional vesk culture’s dismissal of education to become mechanics or even technomancers.",
          "names": "Vesk names are often long and combine elements of their parents’ names, as well as those of other prominent ancestors. These are frequently shortened for daily use by friends, though abridging a vesk’s name without permission is a grave insult. In addition, some vesk take on epithets related to their victories in combat, which they sometimes use in addition to or in place of a family name, such as “Three Guns,” “Voidwalker,” or “Squadeater.” Some sample vesk names include Dmotralan, Evdokayo, Goromitali, Julakesh, Katara, Obozaya, Radokama, Sarangari, Sobok, Terikoraz, and Ymeros-Ahandi."
        },
        {
          "name": "Vlaka",
          "avg_height": "5-1/2 to 6-1/2 ft.",
          "avg_weight": "175–200 lbs.",
          "age_of_maturity": 3,
          "max_age": "30+4d10 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Witchwyrd",
          "avg_height": "6–8 ft.",
          "avg_weight": "200–400 lbs.",
          "age_of_maturity": 100,
          "max_age": "600+10d% years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Wrikreechee",
          "avg_height": "5–7 ft.",
          "avg_weight": "250–350 lbs.",
          "age_of_maturity": 13,
          "max_age": "60+1d20 years",
          "description": "",
          "hit_points": "",
          "type": "",
          "physical_description": "",
          "homeworld": "",
          "society_and_alignment": "",
          "relations": "",
          "adventurers": "",
          "names": ""
        },
        {
          "name": "Ysoki",
          "avg_height": "3-4 ft.",
          "avg_weight": "60-100 lbs.",
          "age_of_maturity": 10,
          "max_age": "60+1d20 years",
          "description": "Small and furtive, the ysoki are often overlooked by larger races. Yet through wit and technological prowess, they’ve spread throughout the Solar system, giving truth to the old adage that every starship needs a few rats.",
          "hit_points": 2,
          "type": "Humanoid",
          "physical_description": "Ranging from 3 to 4 feet tall, ysoki resemble humanoid rats who walk upright, complete with fur, long incisors, constantly twitching noses, and partially prehensile tails that help them keep their balance and maneuver in zero gravity. Their small, dexterous hands are perfect for working on delicate electronics, and their keen noses often allow them to identify complex chemicals by smell. Male and female ysoki are difficult for other races to tell apart, as they have similar body types and favor similar fashions.",
          "homeworld": "The term “ysoki” originates from a vibrant and respected culture, populations of ratfolk (as they’re sometimes called) existed on several worlds for millennia before spaceflight became common. Whether these different populations were examples of convergent evolution or they shared a common ancestor is anyone’s guess, but today most of these cultures now identify as part of the overarching ysoki race. This is due partially to the wide variation in ysoki heredity, which makes ethnicity (and often even immediate family connections) almost impossible to determine by sight or genetics, but even more so to the fact that ysoki have done more than any other ratfolk group to demand and maintain the respect of larger races.",
          "society_and_alignment": "Ysoki society is chaotic and freewheeling, and a typical warren is full of half-finished projects and multiple ysoki talking over each other. Regardless of their role in society, nearly all ysoki hold a deep and abiding love for technology and gadgets, whether it be an Engineer’s love of taking machines apart or a soldier’s appreciation for her armor’s construction. While they traditionally take on roles and societal niches other races view as unpleasant, acting as junkers or squeezing through the innards of starships, this is due not to a lack of pride, but rather an abundance thereofysoki are so sure of their own worth that living in subpar conditions doesn’t shame them. Larger races’ tendency to underestimate or pick on ysoki has left them fiercely loyal to their friends and familiesboth ysoki and otherwiseand a ysoki presented with a gross injustice often feels the need to fling himself teeth-first at the problem, consequences be damned. As a result, the most common ysoki alignment is chaotic good, though they can easily be tugged toward the evil alignments by loyalty or a need to strike back at perceived oppression (or even simple disrespect).",
          "relations": "Friendly and talented, ysoki integrate easily into most civilized societies, sometimes in all-ysoki neighborhoods and other times living side by side with alien cultures. The large size of ysoki families and their tendency to travel also means that a ysoki is shockingly likely to have a cousin or other contact in just about any major settlement. of the major races, ysoki get along best with lashuntas, with whom they’ve traded for millennia, though they appreciate humanity’s pluck and shirrens’ devotion to community, even if the latter are a little too calm for ysoki tastes. They identify with androids’ defiance in the face of prejudice, but they find kasathas too aloof and vesk too obsessed with displaying dominance. Regardless of others’ races, ysoki pride themselves on being quick judges of character, and members of many other races have been surprised to find a ysoki fighting on their behalf after no more than a conversation in a crowded bar. Quick to rile and quick to forgive, fond of laughing at misfortune (both their own and others’), ysoki can sometimes be exhausting, but they are rarely boring.",
          "adventurers": "Though ysoki form strong bonds with their friends and families, these connections are as likely to take them off-world as to keep them at home. Many curious young ysoki sign on with starship crews to see the universe or find their fortunes, and soon adopt their shipmates as a second family. Their natural aptitude with machines most often leads ysoki to become mechanics and technomancers, but they also enjoy the gloriously complicated weaponry employed by operatives and soldiers, and many appreciate the quick-witted patter of envoys.",
          "names": "Ysoki names tend to be short, and even those given longer names inevitably shorten them for informal use. Nicknames are often as important to ysoki as their actual names, and they tend to give both other ysoki and their non-ysoki friends monikers that refer to their personality or physiology, such as “Snack,” “Sparks,” “Twitch,” “Boom-Boom,” or “Dirtbath.” While some ysoki take family names, many use the names of their ships or home settlements instead. Some sample ysoki names include Bena, Coponisa, Cors, Goba, Ketch, Kib, Lolo, Niknik, Quig, Resk, Sim, and Twik."
        }
    ]
}