{
  "weapon_fusions":
  [
    {
      "name": "Anarchic",
      "level": 2,
      "description": "The anarchic fusion imbues a weapon with divine energy from a chaotic deity. Any attacks with the weapon are chaotic-aligned. Damage from the weapon bypasses DR/chaotic and ignores the energy resistance of lawful dragons and lawful outsiders. The anarchic fusion can’t be added to weapons that have the axiomatic fusion."
    },
    {
      "name": "Anchoring",
      "level": 1,
      "description": "A weapon with the anchoring fusion has a chance to immobilize its targets. The weapon gains immobilization as a critical hit effect. If the weapon already has a critical hit effect, choose each time whether to apply the weapon’s normal critical hit effect or the immobilization effect. A target affected by the immobilization critical hit effect is unable to move from its space under its own power for 1d4 rounds. It cannot use any form of movement, including teleportation effects, to change its position. If the target is entirely contained in a mobile object (such as a Starship or large Vehicle), the target is immobile relative to its location within that object. Other creatures and forces can move the target normally."
    },
    {
      "name": "Axiomatic",
      "level": 2,
      "description": "The axiomatic fusion imbues a weapon with divine energy from a lawful deity. Any attacks with the weapon are lawful-aligned. Damage from the weapon bypasses DR/lawful and ignores the energy resistance of chaotic dragons and chaotic outsiders. The axiomatic fusion can’t be added to weapons that have the anarchic fusion."
    },
    {
      "name": "Bane",
      "level": 5,
      "description": "The bane fusion enhances the power of critical hits against certain foes. Against a designated foe, the bane weapon gains the stunned critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit against an appropriate foe, you can apply either the weapon’s normal critical hit effect or the stunned effect. When you add this fusion to a weapon (or create it as a fusion seal), you must select a single creature type (aberration, animal, construct, dragon, fey, humanoid, magical beast, ooze, outsider, plant, undead, or vermin) against which it will apply. If you select humanoid or outsider, you must also select one subtype. The stunned critical hit effect applies only against creatures of the selected type (and subtype, if selected). Once selected, the creature type and subtype can’t be changed."
    },
    {
      "name": "Blasting",
      "level": 2,
      "description": "The blasting fusion allows a weapon to make a single attack as a blast (see the blast weapon special property) once per day as a full action. This attack has a maximum range of 30 feet and deals half the weapon’s normal damage. Only ranged weapons that don’t have the automatic, explode, line, or thrown weapon special property can benefit from the blasting fusion. Weapons that don’t require attack rolls to affect their targets also can’t benefit from the blasting fusion."
    },
    {
      "name": "Bleeding",
      "level": 5,
      "description": "The bleeding fusion weaves entropic energy into the weapon’s form. The weapon gains the bleed critical hit effect. The amount of damage taken each round from this effect is equal to 1d6 per 5 levels of the weapon, rounded down. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the bleed effect. Only weapons that deal piercing or slashing damage can have this fusion."
    },
    {
      "name": "Burst",
      "level": 2,
      "description": "With the burst fusion, a weapon’s energy damage can form a small explosion that spills onto a second target. The weapon gains the arc critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the arc effect. The amount of damage dealt to the secondary target is equal to one-third the level of the weapon with the burst fusion (minimum 1). Only weapons that deal acid, cold, electricity, fire, or sonic damage can benefit from a burst fusion. If your weapon deals more than one type of energy damage, you select one of those types for the arc critical hit effect to apply to secondary targets when the fusion is added."
    },
    {
      "name": "Called",
      "level": 1,
      "description": "A weapon with the called fusion can be teleported to its owner’s hand as a swift action, even if the weapon is in the possession of another creature. This ability has a maximum range of 100 feet, and effects that block teleportation prevent the return of a called weapon. A weapon with the called fusion must be in your possession for at least 24 hours for this ability to function."
    },
    {
      "name": "Corrosive",
      "level": 9,
      "description": "The corrosive fusion weaves the destructive power of acid into the weapon’s form. Half the weapon’s damage type is replaced with acid damage. You can activate or deactivate the corrosive fusion as a swift action. If the weapon already deals two types of damage, replace one of them with acid (you decide which damage type is replaced each time you activate the corrosive fusion). You can add this fusion only to a weapon that does not already deal acid damage. This fusion never causes a weapon that normally targets KAC to target EAC."
    },
    {
      "name": "Deafening",
      "level": 3,
      "description": "With the deafening fusion, a weapon releases a blast of low-frequency sonic energy on impact. The weapon gains the deafen critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the deafen effect. Only weapons that deal bludgeoning, piercing, slashing, or sonic damage can benefit from a deafening fusion."
    },
    {
      "name": "Defiant",
      "level": 1,
      "description": "A weapon with the defiant fusion resists efforts to be removed from its wielder. If you are wielding it when you are knocked unconscious, panicked, or stunned, it stays in your hand. You also gain a bonus to your KAC against combat maneuvers to disarm the weapon equal to one-fifth the weapon’s level (minimum +1)."
    },
    {
      "name": "Devastating",
      "level": 5,
      "description": "You can apply the devastating fusion only to a weapon with two or more critical hit effects. When you score a critical hit with a weapon that has the devastating fusion, you can select two of the critical hit effects to apply to the target (even if you are normally required to select just one critical hit effect)."
    },
    {
      "name": "Dispelling",
      "level": 3,
      "description": "A weapon with the dispelling fusion gathers spare wisps of latent magic during combat, which it can then unleash in a Focused effort to dispel magic. The weapon gains dispelling as a critical hit effect in combat. This ability manifests only in high-stakes situations, so you must be in combat and facing a significant enemy for it to gain this critical hit effect. If there’s any doubt about whether you’re in combat or able to access the critical hit effect, the GM decides. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the dispelling effect. A target affected by the dispelling critical hit effect is the subject of a targeted dispel magic, as the Spell, using the weapon’s item level as the dispel check’s caster level."
    },
    {
      "name": "Disruptive",
      "level": 3,
      "description": "The disruptive fusion imbues a weapon with powerful positive energy designed to disrupt the magical forces that allow undead to exist. The weapon ignores any DR and energy resistance of undead creatures. Only weapons that deal bludgeoning damage can benefit from this fusion."
    },
    {
      "name": "Durable",
      "level": 1,
      "description": "The durable fusion uses magical runes and reinforcements to significantly increase a weapon’s toughness. When determining a weapon’s hardness, Hit Points, and saving throws, treat its item level as being 5 higher. For more about calculating these values, see Breaking Objects."
    },
    {
      "name": "Entangling",
      "level": 2,
      "description": "A weapon with the entangling fusion gains the entangle weapon special property. Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an entangle attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is affected by the entangle condition. The entangle effect ends after 1d4 rounds if the target has not already escaped it. Only weapons that do bludgeoning, piercing, slashing, or cold damage can benefit from this fusion."
    },
    {
      "name": "Flaming",
      "level": 5,
      "description": "The flaming fusion imbues a weapon with the fiery power of a star. Half the weapon’s damage type is replaced with fire damage. You can activate or deactivate the flaming fusion as a swift action. If the weapon already deals two types of damage, replace one of them with fire (you decide which damage type to replace each time you activate the flaming fusion). You can add this fusion only to a weapon that does not already deal fire damage. This fusion never causes a weapon that normally targets KAC to target EAC."
    },
    {
      "name": "Frost",
      "level": 5,
      "description": "The frost fusion imbues a weapon with the icy cold of a dead world far from its system’s sun. Half the weapon’s damage type is replaced with cold damage. You can activate or deactivate the frost fusion as a swift action. If the weapon already deals two types of damage, replace one of them with cold (you decide which damage type to replace each time you activate the frost fusion). You can add this fusion only to a weapon that does not already deal cold damage. This fusion never causes a weapon that normally targets KAC to target EAC."
    },
    {
      "name": "Ghost Killer",
      "level": 5,
      "description": "Attacks from a weapon with this fusion deal full damage to incorporeal creatures. They also pass into the Ethereal Plane, allowing such attacks to affect ethereal creatures normally. Weapons with the ghost killer fusion can also score critical hits against incorporeal creatures. In addition, an incorporeal creature (though not an ethereal one) can pick up, move, or wield a ghost killer weapon."
    },
    {
      "name": "Glamered",
      "level": 1,
      "description": "As a standard action, a weapon with the glamered fusion can be commanded to change its appearance to assume the form of another object of similar size. The weapon retains all its properties (including bulk) when disguised but does not radiate magic. Only true seeing or similar magic reveals the true nature of a glamered weapon while it is in disguise. After a glamered weapon is used to make an attack, this fusion is suppressed for 1 minute."
    },
    {
      "name": "Holy",
      "level": 2,
      "description": "A weapon with the holy fusion becomes blessed with divine energy from a good deity. Any attacks with the fused weapon are good-aligned. Damage from the weapon bypasses DR/good and ignores the energy resistance of evil dragons, evil outsiders, and evil undead. The holy fusion cannot be added to weapons that have the unholy fusion."
    },
    {
      "name": "Hybridized",
      "level": 1,
      "description": "A weapon with the hybridized fusion replaces much of its technological functions with magic counterparts. It gains the analog weapon special property, and the core function of the weapon is considered to be a hybrid of magic and technology (rather than only the fusion counting as a hybrid item). A hybridized weapon still consumes ammunition and battery charges normally."
    },
    {
      "name": "Illuminating",
      "level": 1,
      "description": "The illuminating fusion causes a weapon to gain the bright weapon special property. You can deactivate this fusion as a move action, in which case the weapon acts as if it does not have the bright property until it is reactivated (which also requires a move action)."
    },
    {
      "name": "Knockdown",
      "level": 6,
      "description": "With the knockdown fusion, a weapon disrupts a target’s center of gravity. The weapon gains the knockdown critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the knockdown effect. Only weapons that deal bludgeoning damage can benefit from this fusion."
    },
    {
      "name": "Merciful",
      "level": 2,
      "description": "A weapon with the merciful fusion often hums pleasantly when at rest and makes soft, airy musical noises when it is used to make an attack. The magic of this fusion subdues the damaging effect of the weapon it is added to. While this fusion is active, the weapon’s regular damage becomes nonlethal damage. If the weapon deals two types of damage, both of the damage types become nonlethal. You can activate or deactivate the merciful fusion as a swift action."
    },
    {
      "name": "Ominous",
      "level": 1,
      "description": "A weapon with the ominous fusion trails a shadowy haze behind it and moans a menacing dirge in battle. The weapon gains intimidation as a critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the intimidation effect. A target affected by the intimidation critical hit effect is shaken for 1d4 rounds (Fortitude save negates). A creature that gains the shaken condition from a weapon with the ominous fusion can’t gain that condition again from the same weapon for 24 hours."
    },
    {
      "name": "Returning",
      "level": 1,
      "description": "You can add this fusion only to a weapon that has the thrown weapon special property. A returning weapon flies through the air back to you after you make a thrown ranged attack with it. It returns to you just before your next turn (and is therefore ready to use again in that turn). Catching the weapon when it comes back takes no action. If you can’t catch it, or if you have moved since throwing it, the weapon drops to the ground in the square from which you threw it."
    },
    {
      "name": "Seeking",
      "level": 3,
      "description": "The seeking fusion causes an attack from a weapon to veer toward its target. This negates any miss chance caused by the target having concealment, though it has no effect on miss chances from other sources (and does not offset the miss chance from a target having total concealment)."
    },
    {
      "name": "Shock",
      "level": 5,
      "description": "The shock fusion weaves the electrical energy of the universe into the weapon’s form. Half the weapon’s damage type is replaced with electricity damage. You can activate or deactivate the shock fusion as a swift action. If the weapon already deals two types of damage, replace one of them with electricity (you decide which damage type to replace each time you activate the shock fusion). You can add this fusion only to a weapon that does not already deal electricity damage. This fusion never causes a weapon that normally target KAC to target EAC."
    },
    {
      "name": "Spellthrower",
      "level": 2,
      "description": "A weapon with the Spellthrower fusion is able to have a single Spell gem loaded into it at a time. It takes 1 minute to load a Spell gem, and only gems containing a Spell with a casting time of one standard action or less and a Spell level no greater than one-quarter the weapon’s item level can be loaded into the weapon.\nIf you are proficient with and wielding the weapon, as a full action you can cast the Spell contained within the Spell gem rather than make a normal attack. This allows you to use the Spell gem as if you were a spellcaster with the Spell on your class’s Spell list.\nUnlike the normal rules for using a Spell gem, it does not matter if the gem’s item level is higher than your caster level (even if your caster level is 0). However, if the Spell gem’s item level is higher than your base attack bonus, once you’ve spent the full action to cast the Spell, you must succeed at an attack roll with the weapon against an AC equal to the Spell gem’s level + 1 or you fail to cast the Spell. This roll represents your expertise with the weapon, and no actual attack or ammunition is used. If you fail to cast a Spell from a Spell gem, the Spell is expended harmlessly and the Spell gem is destroyed."
    },
    {
      "name": "Thundering",
      "level": 9,
      "description": "The thundering fusion imbues a weapon with heightened frequency vibrations. Half the weapon’s damage type is replaced with sonic damage. You can activate or deactivate the thundering fusion as a swift action. If the weapon already deals two types of damage, replace one of them with sonic (you decide which damage type to replace each time you activate the thundering fusion). You can add this fusion only to a weapon that does not already deal sonic damage. This fusion never causes a weapon that normally target KAC to target EAC."
    },
    {
      "name": "Trailblazer",
      "level": 1,
      "description": "A weapon with the trailblazer fusion manages to alter the nature of its attacks to overcome the penalties of some natural environmental effects. Its attacks ignore the cover provided by bogs and the cover creatures submerged at least chest deep in water receive from attacks made from the surface. Fire damage dealt by the weapon to underwater targets does half normal damage (rather than the normal one-quarter), and other attacks made underwater deal full damage (rather than the normal half damage).\nAdditionally, ranged attack rolls with the weapon don’t take a penalty due to the effects of storms, strong and severe winds, or windstorms. It can even be used to make ranged attacks in severe storms as if they were typical storms and in hurricane-force winds as if they were strong winds.\nSee Biomes for more information on environments that impose attack penalties, and see Underwater Combat for rules on attacking submerged targets."
    },
    {
      "name": "Unholy",
      "level": 2,
      "description": "The unholy fusion imbues a weapon with divine energy from an evil deity. Any attacks with the fused weapon are evil-aligned. Damage from the weapon overcomes DR/evil and ignores the energy resistance of good dragons and good outsiders. The unholy fusion can’t be added to weapons that have the holy fusion."
    },
    {
      "name": "Venomous",
      "level": 2,
      "description": "A weapon with the venomous fusion gains the injection weapon special property. Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an injection attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is exposed to the drug, medicinal, or poison when you use the injection property in an attack. Only weapons that deal piercing or slashing damage can benefit from this fusion."
    },
    {
      "name": "Vorpal",
      "level": 10,
      "description": "With the vorpal fusion, a weapon can tear between the molecules of a creature. The weapon gains the severe wound critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the severe wound effect. Only a weapon that deals bludgeoning, piercing, or slashing damage can benefit from this fusion."
    },
    {
      "name": "Wounding",
      "level": 7,
      "description": "The wounding fusion causes a weapon to deal exceptionally traumatic damage. The weapon gains the wound critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the wound effect."
    }
  ]
}